let KerberosNTLM = 
    SecurityEvent
    | where TimeGenerated > ago(90d)
    | where EventID in (4624, 4625, 4768, 4769, 4771, 4776)
    | extend AuthProtocol = case(
        EventID in (4768, 4769, 4771), "Kerberos",
        EventID == 4776 or (EventID == 4624 and AuthenticationPackageName == "NTLM"), "NTLMv2",
        "Unknown")
    | project TimeGenerated, EventID, Computer, Account, SubjectUserName, AuthenticationPackageName, IpAddress, AuthProtocol, Source = "SecurityEvent";

let LDAP_Logs = 
    SecurityEvent
    | where TimeGenerated > ago(90d)
    | where EventID in (2886, 2887, 2888, 2889)
    | extend AuthProtocol = "LDAP"
    | project TimeGenerated, EventID, Computer, Account, SubjectUserName, AuthenticationPackageName="", IpAddress="", AuthProtocol, Source = "LDAP_EventLog";

let LDAP_Network = 
    NetworkSession
    | where TimeGenerated > ago(90d)
    | where DestinationPort in (389, 636)
    | extend EventID = int(0), Computer = DestinationIP, Account = "", SubjectUserName = "", AuthenticationPackageName = "", IpAddress = SourceIP, AuthProtocol = case(DestinationPort == 636, "LDAPS", "LDAP"), Source = "NetworkSession"
    | project TimeGenerated, EventID, Computer, Account, SubjectUserName, AuthenticationPackageName, IpAddress, AuthProtocol, Source;

KerberosNTLM
| union LDAP_Logs, LDAP_Network
| sort by TimeGenerated desc