DeviceEvents
| where Timestamp > ago(24h)
| where ActionType in ("ExploitGuardNetworkProtectionBlocked", "ExploitGuardNetworkProtectionAudited")
| extend d = parse_json(AdditionalFields)
| extend Domain   = tostring(d.Domain),
         Url      = tostring(d.Url),
         Category = tostring(d.Category),
         Ip       = tostring(d.Ip)
| project Timestamp, DeviceName, ActionType, Domain, Url, Ip, Category,
          InitiatingProcessAccountName, InitiatingProcessFileName
| order by Timestamp desc



DeviceEvents
| where Timestamp > ago(7d)
| where ActionType in ("ExploitGuardNetworkProtectionBlocked", "ExploitGuardNetworkProtectionAudited")
| extend d = parse_json(AdditionalFields)
| extend Domain = tostring(d.Domain), Url = tostring(d.Url)
| where Domain =~ "badexample.com" or Url has "badexample.com"
| project Timestamp, DeviceName, ActionType, Domain, Url,
          InitiatingProcessFileName, InitiatingProcessAccountName
| order by Timestamp desc

DeviceEvents
| where Timestamp > ago(7d)
| where ActionType == "ExploitGuardNetworkProtectionBlocked"
| summarize Blocks = count() by DeviceName
| order by Blocks desc

DeviceEvents
| where Timestamp > ago(7d)
| where ActionType == "WebContentFilteringBlocked"
| extend d = parse_json(AdditionalFields)
| extend Domain = tostring(d.Domain), Category = tostring(d.Category)
| project Timestamp, DeviceName, Domain, Category, InitiatingProcessFileName
| order by Timestamp desc


DeviceEvents
| where Timestamp > ago(7d)
| where ActionType in ("ExploitGuardNetworkProtectionBlocked", "WebContentFilteringBlocked")
| extend d = parse_json(AdditionalFields)
| extend Domain   = tostring(d.Domain),
         Url      = tostring(d.Url),
         Category = tostring(d.Category)
| project Timestamp, DeviceName,
          Control = iff(ActionType == "WebContentFilteringBlocked", "WCF", "NetworkProtection"),
          Domain, Url, Category, InitiatingProcessFileName
| order by Timestamp desc